#+TITLE: Relationship of Model Parameters and Solution Stability in the Power Walk Page Rank Method.
:PREAMBLE:
# #+OPTIONS: broken-links:auto todo:nil H:9
#+OPTIONS: broken-links:auto H:9
#+OPTIONS: broken-links:auto
#+INFOJS_OPT: view:showall toc:3
#+PLOT: title:"Citas" ind:1 deps:(3) type:2d with:histograms set:"yrange [0:]"
#+OPTIONS: tex:t
#+TODO: TODO IN-PROGRESS WAITING DONE
#+CATEGORY: DProj
:END:
:HTML:
#+INFOJS_OPT: view:info toc:3
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../resources/style.css">
#+CSL_STYLE: ../resources/nature.csl
:END:
:R:
#+PROPERTY: header-args:R :session TADMain :dir ./ :cache yes :eval :exports both
#+PROPERTY: header-args :eval never-export
:END:
:LATEX:
# #+LATEX_HEADER:\twocolumn
#+LATEX_HEADER: \IfFileExists{../resources/style.sty}{\usepackage{../resources/style}}{}
#+LATEX_HEADER: \IfFileExists{../resources/referencing.sty}{\usepackage{../resources/referencing}}{}
#+LATEX_HEADER: \addbibresource{../resources/references.bib}
:END:
** Solving the stationary distribution
:PROPERTIES:
:CUSTOM_ID: iterative-power-method
:END:
Solving the EigenValue problem for a large matrix can be very resource
intensive, for example /Wikipedia/ currently has over 6, 000, 000 pages
cite:WikipediaSizeWikipedia2020 which would correspond to an adjacency matrix
with over $10^{12}$ entries, yet even a relatively fast compiled language like
/Julia/ can struggle to solve the eigen vectors for a matrix of size
$(10^{4})^{2}$ as shown in listing [[eigen-julia]].

The power method, first mentioned in section [[#stationary-distribution]], is a
better suited approach, with respect to performance, because:

1. The method is only looking for one solution
2. The accuracy of the solution (measured by  $\exists\eta\in \mathbb{R}$) can be tuned to improve performance.
  


#+NAME: eigen-julia
#+CAPTION: Time to Solve Eigen Value for matrix of size $n$
#+begin_src julia :results output :exports code
using LinearAlgebra
using TimerOutputs

function time_eigenvec(n)
    T = [ x-n+n*y for x in rand(n), y in rand(n) ]
    t = @elapsed eigvecs(T) return t end

time_eigenvec(10^2)
time_eigenvec(10^3)
# time_eigenvec(10^4) # times out


## : time_eigenvec (generic function with 1 method)
## : 0.072302487
## : 0.814937083
#+end_src

#+RESULTS: eigen-julia
: time_eigenvec (generic function with 1 method)
: 0.072302487
: 0.814937083

